<template>
	<div class="text__wrapper">
		<p class="text__p">
			Покупка автомобиля - это серьезное вложение, и мы понимаем, насколько важно для вас сделать правильный выбор. 
			Поэтому при покупке автомобиля в нашем автосалоне вы можете рассчитывать на множество выгодных автомобильных предложений. 
			В нашем ассортименте представлены автомобили ведущих марок, проверенные на качество и исправность, по доступным ценам.
			 Все автомобили проходят тщательную проверку на наличие скрытых дефектов и подлежат гарантийному обслуживанию. У нас работают высококвалифицированные специалисты, готовые помочь вам выбрать подходящий автомобиль и ответить на все ваши вопросы.
Посетите наш автосалон по адресу <span class="text__p-bold">{{ settings.address }}</span>, и мы поможем вам сделать правильный выбор и получить максимальную выгоду от покупки автомобиля. Посетите наш автосалон и найдите свой идеальный автомобиль с пробегом уже сегодня!
        </p>
		<div class="wrapper__text_benefit">
			<div class="text_benefit_title">
				Почему стоит купить автомобиль именно в автосалоне {{ settings.dealer }}?
			</div>
			<ul class="text_benefit">
				<li>
					<svg-icon name="icon-guarantee"/>
					Наши машины проходят техническую проверку по стандартам автопроизводителей
				</li>
				<li>
					<svg-icon name="icon-guarantee_security"/>
					Гарантируем юридическую чистоту
				</li>
				<li>
					<svg-icon name="icon-car"/>
					Предоставляем широкую линейку автомобилей
				</li>
			</ul>
		</div>
	</div>
</template>

<script>
import {mapGetters} from "vuex";

export default {
	computed: {
		...mapGetters({
			settings: 'settings/settings'
		})
	}
}
</script>