<template>
	<div class="text__wrapper">
		<p class="text__p">
			Добро пожаловать в наш автосалон по адресу<span class="text__p-bold"> {{ settings.address }}</span>! 
		</p>
		<p class="text__p">
			Выбирайте понравившийся автомобиль уже сегодня с выгодной процентной ставкой от <span class="text__p-bold"> "{{ settings.credit_percent }}"</span>

Мы гарантируем прозрачные условия.  Наша команда всегда готова помочь вам сделать правильный выбор.
Наша команда профессионалов поможет вам выбрать автомобиль, учитывая ваши финансовые возможности и пожелания.
 Каждый автомобиль с пробегом проходит тщательную проверку нашими специалистами, чтобы вы могли быть уверены в его надежности и качестве.

Обращайтесь к нам за консультацией и выбирайте свой автомобиль с пробегом уже сегодня! 
</p>
		
	</div>
</template>

<script>
import {mapGetters} from "vuex";

export default {
	computed: {
		...mapGetters({
			settings: 'settings/settings'
		})
	}
}
</script>