<template>
	<div class="text__wrapper">
		<p class="text__p">
			Услуга трейд-ин - это удобный способ обмена вашего старого автомобиля на новый с минимальными затратами и максимальной выгодой для вас. 
Мы предлагаем вам профессиональную оценку вашего автомобиля и возможность получить скидку на покупку нового автомобиля при сдаче своего старого авто. Наши эксперты проведут детальный анализ технического состояния вашего автомобиля и определят его рыночную стоимость. Мы гарантируем честность и прозрачность в оценке вашего автомобиля. 
При сдаче автомобиля в рамках услуги трейд-ин, вы можете получить дополнительную скидку на покупку нового автомобиля. Это значительно сэкономит ваши финансовые ресурсы и позволит приобрести новый автомобиль по наиболее выгодной цене. 
Обращаясь в автосалон <span class="text__p-bold"> "{{ settings.dealer }}"</span> за услугой трейд-ин, вы можете быть уверены в качестве нашего сервиса и профессионализме наших специалистов. Мы всегда готовы помочь вам сделать правильный выбор при покупке нового автомобиля! 
Не откладывайте свой выбор на потом, обратитесь к нам уже сегодня и получите выгодные условия на обмен вашего старого автомобиля на новый.
		</p>
	</div>
</template>

<script>
import {mapGetters} from "vuex";

export default {
	computed: {
		...mapGetters({
			settings: 'settings/settings'
		})
	}
}
</script>